In [3]:
import pandas as pd
import numpy as np

## Pandas Series

In [6]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {'a': 10, 'b': 20, 'c': 30}

In [16]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [28]:
pd.Series(data = my_data, index = d.keys())

a    10
b    20
c    30
dtype: int64

In [30]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [32]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [34]:
ser1 = pd.Series([1, 2, 3, 4], ['USA', 'Germany', 'USSR', 'Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

## Pandas Data Frame

In [37]:
from numpy.random import randn

In [39]:
# Hold a consistent 

np.random.seed(101)

In [41]:
# Create a dataframe

df1 = pd.DataFrame(randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

df1

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
# Accessing the column 

df1['X']

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [45]:
# Look at datatype

type(df1['X'])

pandas.core.series.Series

In [47]:
type(df1)

pandas.core.frame.DataFrame

In [53]:
# Accessing the multiple column

df1[['W', 'X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [59]:
# Adding the new column existing dataframe 

df1['P'] = randn(5)

In [67]:
df1

          W         X         Y         Z         P
A  2.706850  0.628133  0.907969  0.503826  0.390528
B  0.651118 -0.319318 -0.848077  0.605965  0.166905
C -2.018168  0.740122  0.528813 -0.589001  0.184502
D  0.188695 -0.758872 -0.933237  0.955057  0.807706
E  0.190794  1.978757  2.605967  0.683509  0.072960

In [71]:
# Remove the column temporary

df1.drop(columns = ['P'], axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [75]:
df1['new'] = df1['Y'] + df1['Z']
df1

          W         X         Y         Z         P       new
A  2.706850  0.628133  0.907969  0.503826  0.390528  1.411795
B  0.651118 -0.319318 -0.848077  0.605965  0.166905 -0.242112
C -2.018168  0.740122  0.528813 -0.589001  0.184502 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057  0.807706  0.021819
E  0.190794  1.978757  2.605967  0.683509  0.072960  3.289476

In [77]:
# Remove the column permanently

df1.drop(columns = ['P'], axis =1, inplace = True)

In [79]:
df1

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.411795
B  0.651118 -0.319318 -0.848077  0.605965 -0.242112
C -2.018168  0.740122  0.528813 -0.589001 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057  0.021819
E  0.190794  1.978757  2.605967  0.683509  3.289476

In [91]:
# Removing the rows of data frame

df1.drop('E', axis = 0)

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.411795
B  0.651118 -0.319318 -0.848077  0.605965 -0.242112
C -2.018168  0.740122  0.528813 -0.589001 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057  0.021819

In [99]:
# Accessing the dataframe rows base on location label

np.array(df1.loc['A'])

array([2.70684984, 0.62813271, 0.90796945, 0.50382575, 1.4117952 ])

In [101]:
# Acessing the dataframe rows base on location index

np.array(df1.iloc[2])

array([-2.01816824,  0.74012206,  0.52881349, -0.58900053, -0.06018704])

In [105]:
# Acessing the  one specific data

df1.loc['B', 'Z']

0.6059653494949336

In [107]:
# Acessing the multiple specific rows and columns

df1.loc[['A', 'B'], ['Y', 'Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

In [113]:
df1.iloc[[0, 1], [2, 3]]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

In [117]:
booldf = df1 > 0
booldf

       W      X      Y      Z    new
A   True   True   True   True   True
B   True  False  False   True  False
C  False   True   True  False  False
D   True  False  False   True   True
E   True   True   True   True   True

In [119]:
df1[booldf]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.411795
B  0.651118       NaN       NaN  0.605965       NaN
C       NaN  0.740122  0.528813       NaN       NaN
D  0.188695       NaN       NaN  0.955057  0.021819
E  0.190794  1.978757  2.605967  0.683509  3.289476

In [123]:
df1[df1 > 0]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.411795
B  0.651118       NaN       NaN  0.605965       NaN
C       NaN  0.740122  0.528813       NaN       NaN
D  0.188695       NaN       NaN  0.955057  0.021819
E  0.190794  1.978757  2.605967  0.683509  3.289476

In [127]:
df1[df1['W'] > 0]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.411795
B  0.651118 -0.319318 -0.848077  0.605965 -0.242112
D  0.188695 -0.758872 -0.933237  0.955057  0.021819
E  0.190794  1.978757  2.605967  0.683509  3.289476

In [131]:
df1[df1['X'] > 0]['X']

A    0.628133
C    0.740122
E    1.978757
Name: X, dtype: float64

In [133]:
df1[df1['X'] > 0 ][['Y', 'Z']]

          Y         Z
A  0.907969  0.503826
C  0.528813 -0.589001
E  2.605967  0.683509

In [135]:
boolser = df1['X'] > 0
result = df1[boolser]
mycols = ['Y', 'Z']

result[mycols]

          Y         Z
A  0.907969  0.503826
C  0.528813 -0.589001
E  2.605967  0.683509

In [139]:
df1[(df1['X'] > 0 ) & (df1['Y'] > 1)]

          W         X         Y         Z       new
E  0.190794  1.978757  2.605967  0.683509  3.289476

In [141]:
df1[(df1['X'] > 0 ) | (df1['Y'] > 1)]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.411795
C -2.018168  0.740122  0.528813 -0.589001 -0.060187
E  0.190794  1.978757  2.605967  0.683509  3.289476

In [143]:
df1.reset_index()

  index         W         X         Y         Z       new
0     A  2.706850  0.628133  0.907969  0.503826  1.411795
1     B  0.651118 -0.319318 -0.848077  0.605965 -0.242112
2     C -2.018168  0.740122  0.528813 -0.589001 -0.060187
3     D  0.188695 -0.758872 -0.933237  0.955057  0.021819
4     E  0.190794  1.978757  2.605967  0.683509  3.289476

In [145]:
newind = 'CA NY WY OR CO'.split()

In [149]:
df1['States'] = newind

df1

          W         X         Y         Z       new States
A  2.706850  0.628133  0.907969  0.503826  1.411795     CA
B  0.651118 -0.319318 -0.848077  0.605965 -0.242112     NY
C -2.018168  0.740122  0.528813 -0.589001 -0.060187     WY
D  0.188695 -0.758872 -0.933237  0.955057  0.021819     OR
E  0.190794  1.978757  2.605967  0.683509  3.289476     CO

In [153]:
df1.set_index('States')

               W         X         Y         Z       new
States
CA      2.706850  0.628133  0.907969  0.503826  1.411795
NY      0.651118 -0.319318 -0.848077  0.605965 -0.242112
WY     -2.018168  0.740122  0.528813 -0.589001 -0.060187
OR      0.188695 -0.758872 -0.933237  0.955057  0.021819
CO      0.190794  1.978757  2.605967  0.683509  3.289476

In [155]:
# Index multiLevel 

outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hire_index = list(zip(outside, inside))
hire_index = pd.MultiIndex.from_tuples(hire_index)

In [157]:
hire_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [161]:
df2 = pd.DataFrame(randn(6, 2), hire_index, ['A', 'B'])

df2

             A         B
G1 1 -1.136645  0.000366
   2  1.025984 -0.156598
   3 -0.031579  0.649826
G2 1  2.154846 -0.610259
   2 -0.755325 -0.346419
   3  0.147027 -0.479448

In [165]:
df2.loc['G1']

          A         B
1 -1.136645  0.000366
2  1.025984 -0.156598
3 -0.031579  0.649826

In [167]:
df2.loc['G1'].loc[1]

A   -1.136645
B    0.000366
Name: 1, dtype: float64

In [169]:
df2.index.names = ['Groups', 'num']
df2

                   A         B
Groups num
G1     1   -1.136645  0.000366
       2    1.025984 -0.156598
       3   -0.031579  0.649826
G2     1    2.154846 -0.610259
       2   -0.755325 -0.346419
       3    0.147027 -0.479448

In [173]:
df2.loc['G2'].loc[2]['B']

-0.34641850351854453

In [175]:
df2.loc['G1'].loc[2]['A']

1.025984152081572

In [179]:
df2.xs(1, level = 'num')

               A         B
Groups
G1     -1.136645  0.000366
G2      2.154846 -0.610259

## Missing data with pandas

In [2]:
import pandas as pd
import numpy as np

In [4]:
d = {'A': [1, 2, np.nan], 'B': [5, np.nan, np.nan], 'C': [1, 2, 3]}

In [6]:
df1 = pd.DataFrame(d)

In [8]:
df1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [10]:
df1.isnull().sum()

A    1
B    2
C    0
dtype: int64

In [12]:
# Remove the all rows if have null values

df1.dropna(
    axis = 0,
    inplace = False
)

     A    B  C
0  1.0  5.0  1

In [14]:
# Remove the all column if gave any null values

df1.dropna(
    axis = 1,
    inplace = False
)

   C
0  1
1  2
2  3

In [16]:
# Remove the null values if have two or more null data in the specific row

df1.dropna(
    axis = 0,
    thresh = 2
)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [20]:
# Use fillna() method

df1.fillna(value = 'Fill Value')

            A           B  C
0         1.0         5.0  1
1         2.0  Fill Value  2
2  Fill Value  Fill Value  3

In [22]:
# Using missing values for mean value

df1['A'].fillna(
    value = df1['A'].mean()
)

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Group by data

In [37]:
company = ['Google', 'Google', 'MSFT', 'MSFT', 'FB', 'FB']
person = ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah']
sales = [200, 120, 340, 124, 243, 350]

df2 = pd.DataFrame({
    'company':company,
    'person':person,
    'sales':sales
})

df2

  company   person  sales
0  Google      Sam    200
1  Google  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [47]:
# group by base of compnay column

df2.groupby('company').mean('sales')

         sales
company
FB       296.5
Google   160.0
MSFT     232.0

In [51]:
df2.groupby('company').sum('sales')

         sales
company
FB         593
Google     320
MSFT       464

In [65]:
df2.groupby('company')['sales'].std()

company
FB         75.660426
Google     56.568542
MSFT      152.735065
Name: sales, dtype: float64

In [67]:
df2.groupby('company').count()

         person  sales
company
FB            2      2
Google        2      2
MSFT          2      2

In [69]:
df2.groupby('company').max()

          person  sales
company
FB         Sarah    350
Google       Sam    200
MSFT     Vanessa    340

In [71]:
df2.groupby('company').min()

          person  sales
company
FB          Carl    243
Google   Charlie    120
MSFT         Amy    124

In [77]:
df2.groupby('company').describe()

        sales
        count   mean         std    min     25%    50%     75%    max
company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Google    2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [79]:
df2.groupby('company').describe().transpose()

company              FB      Google        MSFT
sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [81]:
df2.groupby('company').describe().transpose()['FB']

sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

## Merging | Joining | Concatenating

In [84]:
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']
}, index = [0, 1, 2, 3])

df2 = pd.DataFrame({
    'A': ['A4', 'A5', 'A6', 'A7'],
    'B': ['B4', 'B5', 'B6', 'B7'],
    'C': ['C4', 'C5', 'C6', 'C7'],
    'D': ['D4', 'D5', 'D6', 'D7']
}, index = [4, 5, 6, 7])

df3 = pd.DataFrame({
    'A': ['A8', 'A9', 'A10', 'A11'],
    'B': ['B8', 'B9', 'B10', 'B11'],
    'C': ['C8', 'C9', 'C10', 'C11'],
    'D': ['D8', 'D9', 'D10', 'D11']
}, index = [8, 9, 10, 11])

In [86]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [88]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [90]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [92]:
# Concat row wise three data frame 

pd.concat([df1, df2, df3],
          axis = 0,
          ignore_index = False
         )

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [94]:
# Concate column wise

pd.concat([df1, df2, df3],
          axis = 1, 
          ignore_index = False
         
         )

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [98]:
left = pd.DataFrame({
    'key' : ['K0', 'K1', 'K2', 'K3'],
    'A' : ['A0', 'A1', 'A2', 'A3'],
    'B' : ['B0', 'B1', 'B2', 'B3']
})

right = pd.DataFrame({
    'key' : ['K0', 'K1', 'K2', 'K3'],
    'C' : ['K0', 'K1', 'K2', 'K3'],
    'D' : ['D0', 'D1', 'D2', 'D3']
})

In [100]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [102]:
right

  key   C   D
0  K0  K0  D0
1  K1  K1  D1
2  K2  K2  D2
3  K3  K3  D3

In [108]:
pd.merge(left, right, how = 'inner', on = 'key')

  key   A   B   C   D
0  K0  A0  B0  K0  D0
1  K1  A1  B1  K1  D1
2  K2  A2  B2  K2  D2
3  K3  A3  B3  K3  D3

# Merging

In [110]:
left = pd.DataFrame({
    'key1' : ['K0', 'K0', 'K1', 'K2'],
    'key2' : ['K0', 'K1', 'K0', 'K1'],
    'A' : ['A0', 'A1', 'A2', 'A3'],
    'B' : ['B0', 'B1', 'B2', 'B3']
})

right = pd.DataFrame({
    'key1' : ['K0', 'K1', 'K1', 'K2'],
    'key2' : ['K0', 'K0', 'K0', 'K0'],
    'C' : ['K0', 'K1', 'K2', 'K3'],
    'D' : ['D0', 'D1', 'D2', 'D3']
})

In [116]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [118]:
right

  key1 key2   C   D
0   K0   K0  K0  D0
1   K1   K0  K1  D1
2   K1   K0  K2  D2
3   K2   K0  K3  D3

In [112]:
pd.merge(left, right, on = ['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  K0  D0
1   K1   K0  A2  B2  K1  D1
2   K1   K0  A2  B2  K2  D2

In [114]:
pd.merge(left, right, how = 'outer', on = ['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   K0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   K1   D1
3   K1   K0   A2   B2   K2   D2
4   K2   K0  NaN  NaN   K3   D3
5   K2   K1   A3   B3  NaN  NaN

In [120]:
pd.merge(left, right, how = 'right', on = ['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  K0  D0
1   K1   K0   A2   B2  K1  D1
2   K1   K0   A2   B2  K2  D2
3   K2   K0  NaN  NaN  K3  D3

In [122]:
pd.merge(left, right, how = 'left', on = ['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   K0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   K1   D1
3   K1   K0  A2  B2   K2   D2
4   K2   K1  A3  B3  NaN  NaN

# Joining

In [130]:
left = pd.DataFrame({
    'A' : ['A0', 'A1', 'A2'],
    'B' : ['B0', 'B1', 'B2']
}, index = ['K0', 'K1', 'K2'])

right = pd.DataFrame({
    'C' : ['C0', 'C1', 'C2'],
    'D' : ['D0', 'D1', 'D2']
}, index = ['K0', 'K2', 'K3'])

In [132]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [134]:
left.join(right, how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   D1
K3  NaN  NaN   C2   D2

## Pandas Operation

In [157]:
df3 = pd.DataFrame({
    'col1': [1, 2, 3, 4],
    'col2': [444, 555, 666, 444],
    'col3': ['abc', 'def', 'ghi', 'xyz']
})

df3

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [159]:
# Descover the unique vlaues

df3.nunique()

col1    4
col2    3
col3    4
dtype: int64

In [161]:
df3['col2'].unique()

array([444, 555, 666])

In [163]:
# Looking at value count

df3['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [165]:
# Create a function 

def time1(x):
    return x*2

In [167]:
df3['col1'].apply(time1)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [173]:
df3['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [175]:
df3['col2'].apply(lambda X: X*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [195]:
# Sort the values

df3.sort_values(by = 'col2',
                axis = 0,
                ascending = True,
                inplace = False
               )

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [197]:
data = {
    'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
    'B': ['one', 'one', 'two', 'two', 'one', 'one'],
    'C': ['x', 'y', 'x', 'y', 'x', 'y'],
    'D': [1, 3, 2, 5, 4, 1]
}

df = pd.DataFrame(data)

In [199]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [203]:
df.pivot_table(values = 'D',
              index = ['A', 'B'],
              columns = ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## Data input and Output

* CSV
* Excel
* HTML
* SQL

In [206]:
#pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /opt/anaconda3/lib/python3.12/site-packages (2.0.30)
Requirement already satisfied: typing-extensions>=4.6.0 in /opt/anaconda3/lib/python3.12/site-packages (from sqlalchemy) (4.12.2)
Note: you may need to restart the kernel to use updated packages.

In [208]:
#pip install lxml

Requirement already satisfied: lxml in /opt/anaconda3/lib/python3.12/site-packages (5.2.1)
Note: you may need to restart the kernel to use updated packages.

In [210]:
#pip install html5lib

Collecting html5lib
  Downloading html5lib-1.1-py2.py3-none-any.whl.metadata (16 kB)
Requirement already satisfied: six>=1.9 in /opt/anaconda3/lib/python3.12/site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in /opt/anaconda3/lib/python3.12/site-packages (from html5lib) (0.5.1)
Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 112.2/112.2 kB 854.9 kB/s eta 0:00:00a 0:00:01
Installing collected packages: html5lib
Successfully installed html5lib-1.1
Note: you may need to restart the kernel to use updated packages.

In [212]:
#pip install BeautifulSoup4

Requirement already satisfied: BeautifulSoup4 in /opt/anaconda3/lib/python3.12/site-packages (4.12.3)
Requirement already satisfied: soupsieve>1.2 in /opt/anaconda3/lib/python3.12/site-packages (from BeautifulSoup4) (2.5)
Note: you may need to restart the kernel to use updated packages.

In [1]:
# Looking at current location

pwd

'/Users/pasindumalinda/machineLearning01/pandas_for_data_anlysis'

In [ ]:
# Save the CSV file

df.to_csv('My_output', index = False)

In [ ]:
# read excel file 

pd.read_csv('Excel_Sample_xlsx', sheetname = 'Sheet1')

In [6]:
# Read HTML data
import pandas as pd
data = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [12]:
type(data)

list

In [20]:
data[0]

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund Sort ascending
0,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
1,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
2,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
3,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
4,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
5,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
6,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
7,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
8,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
9,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537

In [ ]:
# Create sql engine 

from sqlalchemy import create_engine

engine = create_engine('sqlite:///:memory:')
df.to_sql('my_table', engine)
sqldf = pd.read_sql('my_table', con = engine)